src/test/resources/sampleSoapBody.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.handling.interfaces.dddsample.citerus.se/">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:submitReport>
            <!--Optional:-->
            <arg0>
                <completionTime>2022-01-01T00:00:00</completionTime>
                <!--1 or more repetitions:-->
                <trackingIds>2</trackingIds>
                <type>LOAD</type>
                <unLocode>AA234</unLocode>
                <!--Optional:-->
                <voyageNumber>5</voyageNumber>
            </arg0>
        </ws:submitReport>
    </soapenv:Body>
</soapenv:Envelope>